<?php
//Задача 8*
//Да се състави програма която конвертира произволно цяло, положително число от десетична в двоична бройна система. Да се имплементира алгоритма показан на лекциите:
//43:2 | 1
//21:2 | 1
//10:2 | 0
//5:2  | 1
//2:2  | 0
//1:2  | 1
//	     ^
//Следователно 43(10) = 101011(2)

function decToBinary($decNum){
	$num = $decNum;
	while ($num >= 1){
		$tmp = $num%2;
		echo $num.":2 | ".$tmp."<br/>";
		$num=floor($num/2);
	}
	$binNum = decbin($decNum);
	echo "Следователно ".$decNum."<sub>(10)</sub> = ".$binNum."<sub>(2)</sub>";
}
decToBinary(43);
?>