<?php
//Задача 7*
//Да се генерират 2 числа А и В. Да се изведат всички числа от А до В на степен 2 (разделени с запетая). Ако някое число е кратно на 3, да се изведе съобщение че числото се пропуска („skip 3“). Ако сумата от всички изведени числа (без пропуснатите) стане по-голяма от 200, да се прекрати извеждането.
//Пример: За A = 1, B = 107 скрипта трябва да изведе: 1, 4, skip 3, 16, 25, skip 6, 49, 64, skip 9, 100

function generateNums ($a, $b){
	$finalRes = "";
	for($i=$a; $i<$b; $i++){
		$num=$i*$i;
		while($num<$b&&$num<200){
			if($num%3!=0){
				$finalRes .= $num.",";
			}
			else{
				$tmp = sqrt($num);
				$finalRes .=  "skip ".$tmp.",";
			}
			$i++;
			$num=$i*$i;
		}
	}
	$finalRes = substr_replace($finalRes, "", -1);
	echo $finalRes;
}
generateNums(1, 107);

?>